pages/3-1-1-constants.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3.1.1 Constants, Variables and Data Types</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">3.1.1 Constants, Variables and Data Types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Variables, constants, functions and procedures</a>
<ul>
<li><a href="#sec-1-1">Learn It: Definitions</a></li>
<li><a href="#sec-1-2">Learn It: Data Types</a></li>
<li><a href="#sec-1-3">Learn It: Arrays</a></li>
<li><a href="#sec-1-4">Learn It: Boolean Expressions:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Variables, constants, functions and procedures</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It: Definitions</h3>
<div class="outline-text-3" id="text-1-1">

<p>
<i>Data</i>
</p>

<ul class="org-ul">
<li>Data is processed by computers, the resulting information can then be used to make decisions. You need to know the definitions of data and information and the relationship between the two.
</li>

<li>Data is words, numbers, dates, images, sounds etc <b>without</b> context.
</li>

<li>Data items need to be part of a structure, such as a sentence, in order to give them meaning.
</li>
</ul>

<p>
<i>Information</i>
</p>

<ul class="org-ul">
<li>Information is a collection of words, numbers, dates, images, sounds etc. put into <b>context</b>, .i.e. to give them meaning.
</li>
</ul>

<p>
<i>Constant</i>
</p>

<ul class="org-ul">
<li>Data values that stay the same every time a program is executed are known as constants. 
</li>
<li>Constants are not expected to change.
</li>
</ul>

<p>
Examples of a constant within a game might be:
</p>
<ul class="org-ul">
<li>the unit of gravity
</li>
<li>the number of lives available for the player
</li>
<li>the amount of time allowed for a level in a game
</li>
</ul>

<p>
<i>Variable</i>
</p>

<ul class="org-ul">
<li>Variables are data values that can <b>change</b> when the user is asked a question, for example, their age. 
</li>
<li>Variables may change during program execution.
</li>
<li>A variable is a memory location. 
</li>
<li>It has a name that is associated with that location. 
</li>
<li>The memory location is used to hold data. 
</li>

<li>The key difference when comparing a constant to a variable is that the value associated with a variable name may change during program execution. 
</li>
<li>For example 'highScore' would need to be variable to change throughout a game.
</li>
<li>The content and organisation of a computer's memory is not fixed - so neither is the value that is pointed at by a variable.
</li>
<li>When data is read from a variable, the content of the memory location is copied and used in calculations.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It: Data Types</h3>
<div class="outline-text-3" id="text-1-2">

<ul class="org-ul">
<li>integer - are whole numbers represented as binary values. 1-8 bytes
</li>

<li>Boolean - True or False only requires one bit of storage.
</li>

<li>Real (a float in Python) - numbers are numbers that have a fractional part, usually represented using two components: the main number and the fractional part, each of which is a binary number. 
</li>
</ul>
<p>
This is known as a floating-point representation. Most programming languages provide one or more data types based on floating-point representations. They are usually given names like 'float', 'single', 'double', 'real' or 'longreal'.
The number data type can affect the type of calculations that can be performed in a program. 4-8 bytes of storage. 
character - only one symbol, only requires one byte of storage. 
</p>

<ul class="org-ul">
<li>String - Limited to the amount that can be stored in main memory
</li>
</ul>
<p>
They are used for data values that are made up of ordered sequences of characters, such as "hello world". 
A string can contain any sequence of characters, visible or invisible, and characters may be repeated. 
The number of characters in the string is called its length, and "hello world" has length 11 - made up of 10 letters and 1 space. 
There is usually a restriction on the maximum length of a string. 
There is also such a thing as an empty string, which contains no characters - length 0.
</p>

<p>
<i>Explain the purpose of data types within code:</i>
</p>

<ul class="org-ul">
<li>Different types of data are represented in different ways inside a computer and need varying amounts of memory to store them. 
</li>
<li>They also have different operations that can be performed upon them. 
</li>
<li>All values that belong to the same data type will be represented in the same way.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Learn It: Arrays</h3>
<div class="outline-text-3" id="text-1-3">

<ul class="org-ul">
<li>An array is one method of storing data in an organised structure.
</li>
<li>When arrays are created, the program needs to know their size. 
</li>
<li>It needs to know how many player names and scores you want to collect. 
</li>
<li>When an array or any variable is created in a program this is called <b>declaring</b>. 
</li>

<li><b>One Dimensional Arrays</b>
</li>
</ul>



<ul class="org-ul">
<li>Two Dimensional Arrays
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Learn It: Boolean Expressions:</h3>
<div class="outline-text-3" id="text-1-4">


<ul class="org-ul">
<li>NOT
</li>
<li>AND
</li>
<li>OR 
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
